app/views/users/show.html.erb

         <small>
           <%= pluralize(@user.posts.count, 'post') %>,
           <%= pluralize(@user.comments.count, 'comment') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 14]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 8]]

   <p>
     <%= favorite.post.votes.count %> votes.
     <%= favorite.post.comments.count %> comments.
   </p>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY rank DESC LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = ?  [["post_id", 14]]