app/views/posts/_post.html.erb

<% @topic.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY created_at DESC  [["topic_id", 1]]

             submitted <%= time_ago_in_words(post.created_at) %> ago by <%= post.user.name %> <br>
             <%= post.comments.count %> Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 47]]