app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 72], ["LIMIT", 1]]

  def new
    @topic = Topic.find(params[:topic_id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
        @topic = Topic.find(params[:topic_id])
        @post = @topic.posts.build(post_params)
        @post.user = current_user

        if @post.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "topic_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Hello"], ["body", "Example text for a post"], ["created_at", "2017-12-23 00:26:08.039784"], ["updated_at", "2017-12-23 00:26:08.039784"], ["topic_id", 1], ["user_id", 8]]

  def edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id])
    @post.assign_attributes(post_params)

    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?

  def destroy
    @post = Post.find(params[:id])

    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]