app/controllers/topics_controller.rb

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Music"], ["description", "Discussions on music"], ["created_at", "2017-11-14 03:28:18.128907"], ["updated_at", "2017-11-14 03:28:18.128907"]]
---
    def create
        @topic = Topic.new(topic_params)

        if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
    def update
        @topic = Topic.find(params[:id])
        @topic.assign_attributes(topic_params)

            if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 2]]
---
    def destroy
        @topic = Topic.find(params[:id])

        if @topic.destroy