app/controllers/users_controller.rb

    def create
        @user = User.new
        @user.name = params[:user][:name]
        @user.email = params[:user][:email]
        @user.password = params[:user][:password]
        @user.password_confirmation = params[:user][:password_confirmation]

        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?, ?)

    def show
      @user = User.find(params[:id])
      @posts = @user.posts.visible_to(current_user)
      @favorites = Favorite.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY rank DESC  [["user_id", 8]]